; domain
(define (domain satellite-typed)
(:requirements :equality :strips :typing)
(:types satellite
        direction
        instrument
        mode)
(:predicates
 (on_board ?i - instrument ?s - satellite)
 (supports ?i - instrument ?m - mode)
 (pointing ?s - satellite ?d - direction)
 (power_avail ?s - satellite)
 (power_on ?i - instrument)
 (calibrated ?i - instrument)
 (have_image ?d - direction ?m - mode)
 (calibration_target ?i - instrument ?d - direction))

(:action turn_to
 :parameters ( ?s - satellite ?d_new ?d_prev - direction)
 :precondition
 (and
      (pointing ?s ?d_prev)
      )
 :effect
 (and (pointing ?s ?d_new)
      (not (pointing ?s ?d_prev))))

(:action switch_on
 :parameters (?i - instrument ?s - satellite)
 :precondition
 (and (on_board ?i ?s)
      (power_avail ?s))
 :effect
 (and (power_on ?i)
      (not (calibrated ?i))
      (not (power_avail ?s))))

(:action switch_off
 :parameters (?i - instrument ?s - satellite)
 :precondition
	(and (on_board ?i ?s)
             (power_on ?i))
 :effect
	(and (power_avail ?s)
             (not (power_on ?i))))

(:action calibrate
 :parameters (?i - instrument ?s - satellite ?d - direction)
 :precondition
	(and (on_board ?i ?s)
             (calibration_target ?i ?d)
             (pointing ?s ?d)
             (power_on ?i))
 :effect
	 (calibrated ?i))

(:action take_image
 :parameters (?i - instrument ?s - satellite ?d - direction ?m - mode)
 :precondition
	(and (calibrated ?i)
             (on_board ?i ?s)
             (supports ?i ?m)
             (power_on ?i)
             (pointing ?s ?d))
 :effect
	 (have_image ?d ?m))

)

; problem
(DEFINE (PROBLEM SATELLITE-TYPED-LOOP-2) (:DOMAIN SATELLITE-TYPED)
 (:OBJECTS DIRECTION-0 DIRECTION-1 - DIRECTION MODE-0 MODE-1 MODE-2 MODE-3
  MODE-4 MODE-5 MODE-6 MODE-7 MODE-8 - MODE S0-INSTRUMENT-0 S0-INSTRUMENT-1
  S0-INSTRUMENT-2 S1-INSTRUMENT-0 S1-INSTRUMENT-1 S1-INSTRUMENT-2
  S2-INSTRUMENT-0 S2-INSTRUMENT-1 S2-INSTRUMENT-2 - INSTRUMENT SATELLITE-0
  SATELLITE-1 SATELLITE-2 - SATELLITE)
 (:INIT (POINTING SATELLITE-0 DIRECTION-0) (POWER_AVAIL SATELLITE-0)
  (ON_BOARD S0-INSTRUMENT-0 SATELLITE-0)
  (CALIBRATION_TARGET S0-INSTRUMENT-0 DIRECTION-0)
  (ON_BOARD S0-INSTRUMENT-1 SATELLITE-0)
  (CALIBRATION_TARGET S0-INSTRUMENT-1 DIRECTION-0)
  (ON_BOARD S0-INSTRUMENT-2 SATELLITE-0)
  (CALIBRATION_TARGET S0-INSTRUMENT-2 DIRECTION-0)
  (POINTING SATELLITE-1 DIRECTION-0) (POWER_AVAIL SATELLITE-1)
  (ON_BOARD S1-INSTRUMENT-0 SATELLITE-1)
  (CALIBRATION_TARGET S1-INSTRUMENT-0 DIRECTION-0)
  (ON_BOARD S1-INSTRUMENT-1 SATELLITE-1)
  (CALIBRATION_TARGET S1-INSTRUMENT-1 DIRECTION-0)
  (ON_BOARD S1-INSTRUMENT-2 SATELLITE-1)
  (CALIBRATION_TARGET S1-INSTRUMENT-2 DIRECTION-0)
  (POINTING SATELLITE-2 DIRECTION-0) (POWER_AVAIL SATELLITE-2)
  (ON_BOARD S2-INSTRUMENT-0 SATELLITE-2)
  (CALIBRATION_TARGET S2-INSTRUMENT-0 DIRECTION-0)
  (ON_BOARD S2-INSTRUMENT-1 SATELLITE-2)
  (CALIBRATION_TARGET S2-INSTRUMENT-1 DIRECTION-0)
  (ON_BOARD S2-INSTRUMENT-2 SATELLITE-2)
  (CALIBRATION_TARGET S2-INSTRUMENT-2 DIRECTION-0)
  (SUPPORTS S0-INSTRUMENT-0 MODE-0) (SUPPORTS S0-INSTRUMENT-1 MODE-1)
  (SUPPORTS S0-INSTRUMENT-2 MODE-2) (SUPPORTS S1-INSTRUMENT-0 MODE-3)
  (SUPPORTS S1-INSTRUMENT-1 MODE-4) (SUPPORTS S1-INSTRUMENT-2 MODE-5)
  (SUPPORTS S2-INSTRUMENT-0 MODE-6) (SUPPORTS S2-INSTRUMENT-1 MODE-7)
  (SUPPORTS S2-INSTRUMENT-2 MODE-8))
 (:GOAL
  (AND (HAVE_IMAGE DIRECTION-0 MODE-0) (HAVE_IMAGE DIRECTION-0 MODE-1)
       (HAVE_IMAGE DIRECTION-0 MODE-2) (HAVE_IMAGE DIRECTION-0 MODE-3)
       (HAVE_IMAGE DIRECTION-0 MODE-4) (HAVE_IMAGE DIRECTION-0 MODE-5)
       (HAVE_IMAGE DIRECTION-0 MODE-6) (HAVE_IMAGE DIRECTION-0 MODE-7)
       (HAVE_IMAGE DIRECTION-0 MODE-8) (HAVE_IMAGE DIRECTION-1 MODE-0)
       (HAVE_IMAGE DIRECTION-1 MODE-1) (HAVE_IMAGE DIRECTION-1 MODE-2)
       (HAVE_IMAGE DIRECTION-1 MODE-3) (HAVE_IMAGE DIRECTION-1 MODE-4)
       (HAVE_IMAGE DIRECTION-1 MODE-5) (HAVE_IMAGE DIRECTION-1 MODE-6)
       (HAVE_IMAGE DIRECTION-1 MODE-7) (HAVE_IMAGE DIRECTION-1 MODE-8))))

; plan
1. (switch_on s2-instrument-2 satellite-2)
   deleted: (power_avail satellite-2)
   added: (power_on s2-instrument-2)
   goals met: 0 of 18
2. (calibrate s2-instrument-2 satellite-2 direction-0)
   added: (calibrated s2-instrument-2)
   goals met: 0 of 18
3. (take_image s2-instrument-2 satellite-2 direction-0 mode-8)
   added: (have_image direction-0 mode-8)
   goals met: 1 of 18
4. (turn_to satellite-2 direction-1 direction-0)
   deleted: (pointing satellite-2 direction-0)
   added: (pointing satellite-2 direction-1)
   goals met: 1 of 18
5. (take_image s2-instrument-2 satellite-2 direction-1 mode-8)
   added: (have_image direction-1 mode-8)
   goals met: 2 of 18
6. (switch_off s2-instrument-2 satellite-2)
   deleted: (power_on s2-instrument-2)
   added: (power_avail satellite-2)
   goals met: 2 of 18
7. (switch_on s1-instrument-2 satellite-1)
   deleted: (power_avail satellite-1)
   added: (power_on s1-instrument-2)
   goals met: 2 of 18
8. (calibrate s1-instrument-2 satellite-1 direction-0)
   added: (calibrated s1-instrument-2)
   goals met: 2 of 18
9. (take_image s1-instrument-2 satellite-1 direction-0 mode-5)
   added: (have_image direction-0 mode-5)
   goals met: 3 of 18
10. (turn_to satellite-1 direction-1 direction-0)
   deleted: (pointing satellite-1 direction-0)
   added: (pointing satellite-1 direction-1)
   goals met: 3 of 18
11. (take_image s1-instrument-2 satellite-1 direction-1 mode-5)
   added: (have_image direction-1 mode-5)
   goals met: 4 of 18
12. (switch_off s1-instrument-2 satellite-1)
   deleted: (power_on s1-instrument-2)
   added: (power_avail satellite-1)
   goals met: 4 of 18
13. (switch_on s0-instrument-2 satellite-0)
   deleted: (power_avail satellite-0)
   added: (power_on s0-instrument-2)
   goals met: 4 of 18
14. (calibrate s0-instrument-2 satellite-0 direction-0)
   added: (calibrated s0-instrument-2)
   goals met: 4 of 18
15. (take_image s0-instrument-2 satellite-0 direction-0 mode-2)
   added: (have_image direction-0 mode-2)
   goals met: 5 of 18
16. (turn_to satellite-0 direction-1 direction-0)
   deleted: (pointing satellite-0 direction-0)
   added: (pointing satellite-0 direction-1)
   goals met: 5 of 18
17. (take_image s0-instrument-2 satellite-0 direction-1 mode-2)
   added: (have_image direction-1 mode-2)
   goals met: 6 of 18
18. (switch_off s0-instrument-2 satellite-0)
   deleted: (power_on s0-instrument-2)
   added: (power_avail satellite-0)
   goals met: 6 of 18
19. (switch_on s2-instrument-1 satellite-2)
   deleted: (power_avail satellite-2)
   added: (power_on s2-instrument-1)
   goals met: 6 of 18
20. (turn_to satellite-2 direction-0 direction-1)
   deleted: (pointing satellite-2 direction-1)
   added: (pointing satellite-2 direction-0)
   goals met: 6 of 18
21. (calibrate s2-instrument-1 satellite-2 direction-0)
   added: (calibrated s2-instrument-1)
   goals met: 6 of 18
22. (take_image s2-instrument-1 satellite-2 direction-0 mode-7)
   added: (have_image direction-0 mode-7)
   goals met: 7 of 18
23. (turn_to satellite-2 direction-1 direction-0)
   deleted: (pointing satellite-2 direction-0)
   added: (pointing satellite-2 direction-1)
   goals met: 7 of 18
24. (take_image s2-instrument-1 satellite-2 direction-1 mode-7)
   added: (have_image direction-1 mode-7)
   goals met: 8 of 18
25. (switch_off s2-instrument-1 satellite-2)
   deleted: (power_on s2-instrument-1)
   added: (power_avail satellite-2)
   goals met: 8 of 18
26. (switch_on s2-instrument-0 satellite-2)
   deleted: (power_avail satellite-2)
   added: (power_on s2-instrument-0)
   goals met: 8 of 18
27. (turn_to satellite-2 direction-0 direction-1)
   deleted: (pointing satellite-2 direction-1)
   added: (pointing satellite-2 direction-0)
   goals met: 8 of 18
28. (calibrate s2-instrument-0 satellite-2 direction-0)
   added: (calibrated s2-instrument-0)
   goals met: 8 of 18
29. (take_image s2-instrument-0 satellite-2 direction-0 mode-6)
   added: (have_image direction-0 mode-6)
   goals met: 9 of 18
30. (turn_to satellite-2 direction-1 direction-0)
   deleted: (pointing satellite-2 direction-0)
   added: (pointing satellite-2 direction-1)
   goals met: 9 of 18
31. (take_image s2-instrument-0 satellite-2 direction-1 mode-6)
   added: (have_image direction-1 mode-6)
   goals met: 10 of 18
32. (switch_on s1-instrument-1 satellite-1)
   deleted: (power_avail satellite-1)
   added: (power_on s1-instrument-1)
   goals met: 10 of 18
33. (turn_to satellite-1 direction-0 direction-1)
   deleted: (pointing satellite-1 direction-1)
   added: (pointing satellite-1 direction-0)
   goals met: 10 of 18
34. (calibrate s1-instrument-1 satellite-1 direction-0)
   added: (calibrated s1-instrument-1)
   goals met: 10 of 18
35. (take_image s1-instrument-1 satellite-1 direction-0 mode-4)
   added: (have_image direction-0 mode-4)
   goals met: 11 of 18
36. (turn_to satellite-1 direction-1 direction-0)
   deleted: (pointing satellite-1 direction-0)
   added: (pointing satellite-1 direction-1)
   goals met: 11 of 18
37. (take_image s1-instrument-1 satellite-1 direction-1 mode-4)
   added: (have_image direction-1 mode-4)
   goals met: 12 of 18
38. (switch_off s1-instrument-1 satellite-1)
   deleted: (power_on s1-instrument-1)
   added: (power_avail satellite-1)
   goals met: 12 of 18
39. (switch_on s1-instrument-0 satellite-1)
   deleted: (power_avail satellite-1)
   added: (power_on s1-instrument-0)
   goals met: 12 of 18
40. (turn_to satellite-1 direction-0 direction-1)
   deleted: (pointing satellite-1 direction-1)
   added: (pointing satellite-1 direction-0)
   goals met: 12 of 18
41. (calibrate s1-instrument-0 satellite-1 direction-0)
   added: (calibrated s1-instrument-0)
   goals met: 12 of 18
42. (take_image s1-instrument-0 satellite-1 direction-0 mode-3)
   added: (have_image direction-0 mode-3)
   goals met: 13 of 18
43. (turn_to satellite-1 direction-1 direction-0)
   deleted: (pointing satellite-1 direction-0)
   added: (pointing satellite-1 direction-1)
   goals met: 13 of 18
44. (take_image s1-instrument-0 satellite-1 direction-1 mode-3)
   added: (have_image direction-1 mode-3)
   goals met: 14 of 18
45. (switch_on s0-instrument-1 satellite-0)
   deleted: (power_avail satellite-0)
   added: (power_on s0-instrument-1)
   goals met: 14 of 18
46. (turn_to satellite-0 direction-0 direction-1)
   deleted: (pointing satellite-0 direction-1)
   added: (pointing satellite-0 direction-0)
   goals met: 14 of 18
47. (calibrate s0-instrument-1 satellite-0 direction-0)
   added: (calibrated s0-instrument-1)
   goals met: 14 of 18
48. (take_image s0-instrument-1 satellite-0 direction-0 mode-1)
   added: (have_image direction-0 mode-1)
   goals met: 15 of 18
49. (turn_to satellite-0 direction-1 direction-0)
   deleted: (pointing satellite-0 direction-0)
   added: (pointing satellite-0 direction-1)
   goals met: 15 of 18
50. (take_image s0-instrument-1 satellite-0 direction-1 mode-1)
   added: (have_image direction-1 mode-1)
   goals met: 16 of 18
51. (switch_off s0-instrument-1 satellite-0)
   deleted: (power_on s0-instrument-1)
   added: (power_avail satellite-0)
   goals met: 16 of 18
52. (switch_on s0-instrument-0 satellite-0)
   deleted: (power_avail satellite-0)
   added: (power_on s0-instrument-0)
   goals met: 16 of 18
53. (turn_to satellite-0 direction-0 direction-1)
   deleted: (pointing satellite-0 direction-1)
   added: (pointing satellite-0 direction-0)
   goals met: 16 of 18
54. (calibrate s0-instrument-0 satellite-0 direction-0)
   added: (calibrated s0-instrument-0)
   goals met: 16 of 18
55. (take_image s0-instrument-0 satellite-0 direction-0 mode-0)
   added: (have_image direction-0 mode-0)
   goals met: 17 of 18
56. (turn_to satellite-0 direction-1 direction-0)
   deleted: (pointing satellite-0 direction-0)
   added: (pointing satellite-0 direction-1)
   goals met: 17 of 18
57. (take_image s0-instrument-0 satellite-0 direction-1 mode-0)
   added: (have_image direction-1 mode-0)
   goals met: 18 of 18
